app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'adminpuninar'
 LIMIT 1
---
        $password = $this->request->getPost('password');

        // Attempt to authenticate user
        $user = $this->userModel->where('username', $username)->first();