app/Controllers/DashboardController.php

    private function getDashboardStats(int $userLevel): array
    {
        $stats = [];

        // Common statistics for all users
        $stats['total_shipments'] = $this->pengirimanModel->countAll();
        $stats['pending_shipments'] = $this->pengirimanModel->where('status', SHIPMENT_STATUS_PENDING)->countAllResults();
        $stats['delivered_shipments'] = $this->pengirimanModel->where('status', SHIPMENT_STATUS_DELIVERED)->countAllResults();
        $stats['in_transit_shipments'] = $this->pengirimanModel->where('status', SHIPMENT_STATUS_IN_TRANSIT)->countAllResults();

        // Time-based statistics
        $stats['today_shipments'] = $this->pengirimanModel->where('DATE(tanggal)', date('Y-m-d'))->countAllResults();
        $stats['this_week_shipments'] = $this->pengirimanModel->where('WEEK(tanggal)', date('W'))->where('YEAR(tanggal)', date('Y'))->countAllResults();
        $stats['this_month_shipments'] = $this->pengirimanModel->where('MONTH(tanggal)', date('m'))->where('YEAR(tanggal)', date('Y'))->countAllResults();

        // Previous period comparisons
        $stats['last_month_shipments'] = $this->pengirimanModel
            ->where('MONTH(tanggal)', date('m', strtotime('-1 month')))
            ->where('YEAR(tanggal)', date('Y', strtotime('-1 month')))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `pengiriman`
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE `status` = 2
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE DATE(tanggal) = '2025-08-23'
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE WEEK(tanggal) = '34'
AND YEAR(tanggal) = '2025'
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE MONTH(tanggal) = '08'
AND YEAR(tanggal) = '2025'
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE MONTH(tanggal) = '07'
AND YEAR(tanggal) = '2025'

        switch ($userLevel) {
            case USER_LEVEL_ADMIN:
                // Admin can see all statistics
                $stats['total_items'] = $this->barangModel->countAll();
                $stats['total_customers'] = $this->pelangganModel->countAll();
                $stats['total_couriers'] = $this->kurirModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT COUNT(*) AS `numrows` FROM `pelanggan`
SELECT COUNT(*) AS `numrows` FROM `kurir`


            case USER_LEVEL_FINANCE:
                // Finance can see customer and shipment statistics
                $stats['total_customers'] = $this->pelangganModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pelanggan`


            case USER_LEVEL_GUDANG:
                // Gudang can see item and shipment statistics
                $stats['total_items'] = $this->barangModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `barang`

    private function getMonthlyTrends(): array
    {
        $trends = [];

        for ($i = 11; $i >= 0; $i--) {
            $date = date('Y-m', strtotime("-{$i} months"));
            $month = date('M', strtotime("-{$i} months"));

            $total = $this->pengirimanModel
                ->where("DATE_FORMAT(tanggal, '%Y-%m')", $date)
                ->countAllResults();

            $delivered = $this->pengirimanModel
                ->where("DATE_FORMAT(tanggal, '%Y-%m')", $date)
                ->where('status', SHIPMENT_STATUS_DELIVERED)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE DATE_FORMAT(tanggal, '%Y-%m') = '2024-09'
SELECT COUNT(*) AS `numrows`
FROM `pengiriman`
WHERE DATE_FORMAT(tanggal, '%Y-%m') = '2024-09'
AND `status` = 2

    private function getRecentActivities(int $userLevel): array
    {
        $activities = [];

        // Get recent shipments
        $recentShipments = $this->pengirimanModel
            ->select('pengiriman.*, pelanggan.nama as nama_pelanggan')
            ->join('pelanggan', 'pelanggan.id_pelanggan = pengiriman.id_pelanggan')
            ->orderBy('pengiriman.tanggal', 'DESC')
            ->limit(5)
            ->asArray()
            ->findAll();
---
SELECT `pengiriman`.*, `pelanggan`.`nama` as `nama_pelanggan`
FROM `pengiriman`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pengiriman`.`id_pelanggan`
ORDER BY `pengiriman`.`tanggal` DESC
 LIMIT 5