app/Models/PelangganModel.php

SELECT COUNT(*) AS `numrows`
FROM `pelanggan`
SELECT *
FROM `pelanggan`
ORDER BY `id_pelanggan` ASC
 LIMIT 15
---
    public function getAllWithFilter(array $filter = [], int $limit = 15, int $offset = 0, string $orderBy = 'id_pelanggan', string $orderType = 'ASC'): array
    {
        $builder = $this->builder();

        // Apply keyword filter
        if (!empty($filter['keyword'])) {
            $keyword = strtolower($filter['keyword']);
            $builder->groupStart()
                    ->like('LOWER(id_pelanggan)', $keyword)
                    ->orLike('LOWER(nama)', $keyword)
                    ->orLike('LOWER(telepon)', $keyword)
                    ->orLike('LOWER(alamat)', $keyword)
                    ->groupEnd();
        }

        // Get total count
        $total = $builder->countAllResults(false);

        // Apply ordering and pagination
        $builder->orderBy($orderBy, $orderType);

        if ($limit > 0) {
            $builder->limit($limit, $offset);
        }

        $data = $builder->get()->getResult($this->returnType);